# Clean Assignment 1
***

In [1239]:
import re
import numpy as np
import pandas as pd

Load file to `df`

In [1240]:
doc = []
with open('dates.txt') as file:
    for line in file:
        doc.append(line)

df = pd.Series(doc)
df.head()

0         03/25/93 Total time of visit (in minutes):\n
1                       6/18/85 Primary Care Doctor:\n
2    sshe plans to move as of 7/8/71 In-Home Servic...
3                7 on 9/27/75 Audit C Score Current:\n
4    2/6/96 sleep studyPain Treatment Pain Level (N...
dtype: object

#### Testing a function broken out -- Step 1

Numeric month day year

In [1241]:
numeric_month_regex = r'(?P<fullstr>(?P<month>\d?\d)[/|-](?P<day>\d{,2})[/|-](?P<year>\d{,4}))'
numeric_month_day_year = df.str.extractall(numeric_month_regex)

print("Number found: {}".format(numeric_month_day_year.shape[0]))

Number found: 127

In [1242]:
numeric_month_day_year.head()

          fullstr month day year
  match
0 0      03/25/93    03  25   93
1 0       6/18/85     6  18   85
2 0        7/8/71     7   8   71
3 0       9/27/75     9  27   75
4 0        2/6/96     2   6   96

In [1243]:
#only include months 1 - 12
numeric_month_day_year = numeric_month_day_year[numeric_month_day_year['month'].astype(int).between(1, 12, inclusive=True)]

#Strip days > 31
numeric_month_day_year = numeric_month_day_year[numeric_month_day_year['day'].astype(int) < 32]

Filter out dates caught from the full dataframe

In [1244]:
df = df[~df.index.isin(numeric_month_day_year.index.get_level_values(0))]

#### Step 2

String month day year

In [1245]:
str_month_regex = r'(?P<fullstr>(?P<month>(?:Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec)[a-z]*(?:\d{,2})).*(?:[. ])(?P<day>\d{2}).(?:[/.|, ])(?P<year>\d{2,4}))'
str_month_day_year = df.str.extractall(str_month_regex)

print("Number found: {}".format(str_month_day_year.shape[0]))

Number found: 29

In [1246]:
str_month_day_year.head()

                     fullstr     month day  year
    match
194 0         April 11, 1990     April  11  1990
195 0           May 30, 2001       May  30  2001
196 0           Feb 18, 1994       Feb  18  1994
197 0      February 18, 1981  February  18  1981
198 0      October. 11, 2013   October  11  2013

Filter out dates caught from the dataframe

In [1248]:
df = df[~df.index.isin(str_month_day_year.index.get_level_values(0))]

#### Step 3

day month year - this was edited. the new version drops the count from >100 to 70. step 4 then jumps up

In [1249]:
#My original
day_month_regex = r'(?P<fullstr>(?P<day>\d{,2}\s)(?P<month>(?:Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec)[a-z]*(?:\d{,2}\s))(?P<year>\d{,4}))'
#New version -- delete the one below
day_month_regex = r'(?P<fullstr>(?P<day>\d?\d) ?(?P<month>[a-zA-Z]{3,})\.?,? (?P<year>\d{4}))'
day_month_year = df.str.extractall(day_month_regex)

print("Number found: {}".format(day_month_year.shape[0]))

Number found: 70

In [1250]:
day_month_year = day_month_year[['fullstr', 'month', 'day', 'year']]
day_month_year.head()

                fullstr month day  year
    match
125 0       24 Jan 2001   Jan  24  2001
126 0       10 Sep 2004   Sep  10  2004
127 0       26 May 1982   May  26  1982
128 0      28 June 2002  June  28  2002
129 0       06 May 1972   May  06  1972

Filter out dates caught from the dataframe

In [1252]:
df = df[~df.index.isin(day_month_year.index.get_level_values(0))]

In [1253]:
day_month_regex = r'(?P<fullstr>(?P<day>\d?\d) ?(?P<month>[a-zA-Z]{3,})\.?,? (?P<year>\d{4}))'
day_month_year2 = df.str.extractall(day_month_regex)

print("Number found: {}".format(day_month_year2.shape[0]))

Number found: 0

In [1254]:
day_month_year2 = day_month_year2[['fullstr', 'month', 'day', 'year']]
day_month_year2.head()

Empty DataFrame
Columns: [fullstr, month, day, year]
Index: []

In [1255]:
df = df[~df.index.isin(day_month_year2.index.get_level_values(0))]

#### Step 4

Month year numeric

In [1256]:
#my original below
#month_year_regex = r'(?P<fullstr>(?P<month>\d?\d)[/|-](?P<year>\d{,4}))'
#new from github
month_year_regex = r'(?P<fullstr>(?P<month>\d\d?)/(?P<year>\d{4}))'
month_year_num = df.str.extractall(month_year_regex)

print("Number found: {}".format(month_year_num.shape[0]))

Number found: 112

In [1257]:
month_year_num['day'] = 1
month_year_num = month_year_num[['fullstr', 'month', 'day', 'year']]
month_year_num.head()

           fullstr month  day  year
    match
343 0       6/1998     6    1  1998
344 0       6/2005     6    1  2005
345 0      10/1973    10    1  1973
346 0       9/2005     9    1  2005
347 0      03/1980    03    1  1980

In [1259]:
df = df[~df.index.isin(month_year_num.index.get_level_values(0))]

#### Step 5

Month year

In [1260]:
month_year_regex = r'(?P<fullstr>(?P<month>(?:Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec)[a-z]*)[,\s]*(?P<year>\d{,4}))'
month_year = df.str.extractall(month_year_regex)

print("Number found: {}".format(month_year.shape[0]))

Number found: 123

In [1261]:
month_year['day'] = 1
month_year = month_year[['fullstr', 'month', 'day', 'year']]
month_year.head()

              fullstr    month  day year
    match
199 0          Jan 24      Jan    1   24
206 0      October 23  October    1   23
207 0       August 12   August    1   12
219 0          Dec 14      Dec    1   14
223 0      October 14  October    1   14

In [1222]:
df = df[~df.index.isin(month_year.index.get_level_values(0))]

#### Step 6

Year only

In [1223]:
year_regex = r'(?P<fullstr>(?P<year>\d{4}))'
year = df.str.extractall(year_regex)

print("Number found: {}".format(year.shape[0]))

Number found: 44

In [1224]:
year['day'] = 1
year['month'] = 1
year = year[['fullstr', 'month', 'day', 'year']]
year.head()

          fullstr  month  day  year
    match
455 0        1984      1    1  1984
456 0        2000      1    1  2000
457 0        2001      1    1  2001
459 0        1998      1    1  1998
460 0        2012      1    1  2012

In [1225]:
df = df[~df.index.isin(year.index.get_level_values(0))]

Fill in month and day with 1 & 1

FINISHED!

In [1226]:
df.shape

(0,)

### Tie it all together

Find idx 458

In [1227]:
all_data = pd.concat(
    [
        numeric_month_day_year,
        str_month_day_year,
        day_month_year,
        day_month_year2,
        month_year,
        month_year_num,
        year
    ], 
    axis=0
)

#Drop erroneous records
all_data = all_data[all_data.year.notnull()]

In [1228]:
# Append '19' to years with length == 2
all_data.loc[all_data['year'].str.len() == 2, 'year'] = '19' + all_data.loc[all_data['year'].str.len() == 2, 'year']

In [1229]:
all_data.reset_index(level='match', inplace=True)
all_data.sort_index(inplace=True)

#Fill in missing days
all_data.loc[all_data['day'] == ' ', 'day'] = 1

# Troubleshooting

458

Issue is taking place in step 5 - we're picking up declined vs. the month and year

In [1267]:
idx_num = 206
#idx_num = 458
df[idx_num]

'Queen Hamilton in Bonita Springs courthouse.  Ends October 23 1990 Current legal stresses/needs:\n'

In [1266]:
#V1
regex = r'(?P<fullstr>(?P<year>\d{4}))'

#step 5
regex =  r'(?P<fullstr>(?P<month>(?:Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec)[a-z]{2,})[,\s]*(?P<year>\d{,4}))'

#test
#regex = r'(?P<origin>(?P<month>[A-Z][a-z]{2,}),?\.? (?P<year>\d{4}))'

re.findall(
    regex,
    df[idx_num]
)

[('Declined\n', 'Declined', '')]